dupont-al-videotron-ca/JTAGICE/Embedded/Src++/AT90UsbDevice.cpp

#include <stdint.h>
#ifdef __XC
#include <xc.h>
#else
#include <avr/pgmspace.h>
#endif
#include "AT90UsbDevice.h"
#include "usb_drv.h"
#include "usart_debug.h"
#include "AT90UsbKey.h"


const char Allo[] = "Papounet";

// Storing in ROM
const uint8_t USB_Interfaces[USB_MaxConfigurations] = {1, 0, 0, 0}; // number of interfaces in each configuration
const uint8_t USB_MaxPower_2mA[USB_MaxConfigurations] = {50, 0, 0, 0}; // power consumption of each configuration in 2mA units
const uint8_t USB_AltSettings[USB_MaxConfigurations][USB_MaxInterfaces] =
{{1, 0, 0, 0}, // number of alt. settings of interfaces of first configuration
{0, 0, 0, 0}, // number of alt. settings of interfaces of second configuration
{0, 0, 0, 0},
{0, 0, 0, 0}};
const uint8_t USB_Endpoints[USB_MaxConfigurations][USB_MaxInterfaces] =
{{3, 0, 0, 0}, // number of endpoints of interfaces of first configuration
{0, 0, 0, 0}, // number of endpoints of interfaces of second configuration
{0, 0, 0, 0},
{0, 0, 0, 0}};

AT90UsbDevice::AT90UsbDevice()
{
    // Accessing in code
    memset(_UsbEndpoints, 0, UsbNumEndpointsAT90USB);
    memset(AltSettingOfInterface, UsbInterfaceUnconfigured, USB_MaxInterfaces);

    _UsbEndpoints[0] = &this->_UsbEndpointControl;
    _UsbEndpoints[1] = new UsbEndpointIn(1);
    _UsbEndpoints[2] = new UsbEndpointIn(2);
    _UsbEndpoints[3] = new UsbEndpointIn(3);
    
    UsbDevConfValue = UsbUnconfiguredState;
    RemoteWakeupActive = 0;
    IsSuspendResumingActive = false;
}

void AT90UsbDevice::InitHardware(bool lowspeed)
{
    // SUDD main()
    // Init cpu clock
    CLKPR = (1 << 7);
    CLKPR = 0; // clock prescaler == 0, so we have 16 MHz mpu frequency with our 16 MHz crystal

    // Init USART
    USART_Init();
    USART_WriteString((char*)Allo);
    USART_WriteString("\r\n----------------------------------------------------------\r\n");

    // LED
    BoardPortDLedInit();
    BoardPortDLedsOff();

    // UsbInitialReset
    USBCON	= (1<<FRZCLK);
    OTGIEN	= 0;
    UDIEN	= 0;
    UHIEN	= 0;
    UEIENX	= 0;
    UPIENX	= 0;
    UHWCON	= (1<<UIMOD);
    
    
    if(!DoPowerOn())
    {
        BoardPortD5RedOn();
        BoardPortD2RedOn();
        while(1);
    }
    
    if (lowspeed)
    {
        UsbDevSelectLowSpeed(); // full speed is default
    }

    UsbEnableVBUS_TransitionInt();
    
}



UsbEndpointBase* AT90UsbDevice::GetUsbEndpoint(uint8_t index)
{
    if(index < 0 || index >= UsbNumEndpointsAT90USB)
    return NULL;
    
    return _UsbEndpoints[index];
}

bool AT90UsbDevice::StartPLL()
{
    int i = 0;

    // Start PLL and enable clock
    UsbSetPLL_XTAL_Frequency();
    UsbEnablePLL();
    
    // wait 100ms
    while (i++ != 0 && !UsbIsPLL_Locked())
    {
        asm volatile ("nop"); // necessary for avr-gcc 4.x to prevent removing of empty delay loop
    }
    
    // remove freeze
    UsbEnableClock();
    return true;
}

void AT90UsbDevice::StopPLL()
{
    // freeze clk
    UsbFreezeClock();

    // Stop PLL
    UsbDisablePLL();
}


bool AT90UsbDevice::DoPowerOn()
{
    // init USB device mode
    if (1) // set it to (1) if you need very small code size (i.e. bootloader, saves 78 bytes)
    {
        UHWCON = ((1<<UIMOD) | (1<<UVREGE));
        USBCON = ((1<<USBE) | (1<<OTGPADE) | (1<<FRZCLK));
        asm volatile ("nop"); // nop may be are necessary if mpu is clocked with 16 MHz (deactivated prescaler)
        // asm volatile ("nop");
        
        USBCON = ((1<<USBE) | (1<<OTGPADE));
        USBCON = ((1<<USBE) | (1<<OTGPADE) | (1<<FRZCLK)); // setting FRZCLK again in not necessary (see below)
        UDIEN = ((1<<WAKEUPE) | (1<<EORSTE));
    }
    else // do the same thing, bit for bit, with named macros
    {
        UsbEnablePadsRegulator();
        UsbEnableController();
        UsbEnableOTG_Pad(); // necessary to power on the device (undocumented feature)
        UsbDisableUID_ModeSelection();
        UsbSetDeviceMode();
        UsbSetDeviceModeReg();

        UsbEnableClock(); // without this no (wakeup) interrupt is triggered!!!
        UsbFreezeClock(); // FreezeClock() is not really necessary, but we may feel better because PLL in not running yet
        UsbDevEnableWakeupCPU_Int();
        UsbDevEnableEndOfResetInt(); // call this AFTER (UsbEnableController(); UsbEnableOTG_Pad();)
    }
    
    StartPLL();
    UsbDevAttach();

    return true;
}

void AT90UsbDevice::DoPowerOff()
{
    UsbDevDetach();
    StopPLL();
    UsbDisablePadsRegulator();
    UsbDisableController();
}

void AT90UsbDevice::FatalError()
{
    
    BoardPortD2RedOn();
    BoardPortD5RedOn();
//    while (1)
    {
        volatile int i = 100;
        while (--i > 0)
        {
            
        }
        
        BoardPortD2RedToggle();
    }
}

void AT90UsbDevice::ProcessDeviceInterrupt()
{
    if(_interruptDeviceStatus.U_UDINT.Data == 0 && _interruptDeviceStatus.U_USBINT.Data == 0)
    {
        return;
    }


    if(_interruptDeviceStatus.U_USBINT.Flags.ID_flg == 1)
    {
        _interruptDeviceStatus.U_USBINT.Flags.ID_flg = 0;
        Debug("=== ID pin has changed\r\n");
    }

    if(_interruptDeviceStatus.U_USBINT.Flags.VBUS_flg == 1)
    {
        _interruptDeviceStatus.U_USBINT.Flags.VBUS_flg = 0;
        if (UsbIsVBUS_PinHigh())
        {
            BoardPortD2GreenOn();
            UsbDevAttach();
            //            DoPowerOn();

        }
        else
        {
            BoardPortD2GreenOff();
            BoardPortD5AmberOff();
            UsbDevDetach();
            //TODO::
            //            DoPowerOff();
        }
        
        Debug("=== VBUS pin has changed\r\n");
    }
    
    if(_interruptDeviceStatus.U_UDINT.Flags.EORST_flg == 1)
    {
        _interruptDeviceStatus.U_UDINT.Flags.EORST_flg = 0;
        _endOfResetCnt++;

        //BoardPortD5RedOff();
        //BoardPortD5GreenOff();
        if(_UsbEndpointControl.InitializeEndpoint(EP0_FIFO_Size, 1))
        {
            //BoardPortD5GreenOn();            
        }
        else
        {
            BoardPortD5RedOn();            
        }
        
        
        Debug("=== End Of Reset Flag Set\r\n");
    }
    
    if(_interruptDeviceStatus.U_UDINT.Flags.WAKEUP_flg == 1)
    {
        UsbDevDisableWakeupCPU_Int();
        _interruptDeviceStatus.U_UDINT.Flags.WAKEUP_flg = 0;
        //StartPLL();
        Debug("=== Wakeup CPU Flag Set\r\n");

    }
    
    if(_interruptDeviceStatus.U_UDINT.Flags.UPRSM_flg == 1)
    {
        _interruptDeviceStatus.U_UDINT.Flags.UPRSM_flg = 0;
        Debug("=== Upstream Resume Flag Set\r\n");
    }
    
    if(_interruptDeviceStatus.U_UDINT.Flags.EORSM_flg == 1)
    {
        _interruptDeviceStatus.U_UDINT.Flags.EORSM_flg = 0;
        Debug("=== End Of Resume Flag Set\r\n");
    }
    
    if(_interruptDeviceStatus.U_UDINT.Flags.SOF_flg == 1)
    {
        _interruptDeviceStatus.U_UDINT.Flags.SOF_flg = 0;
        if(UsbDevIsFrameNumberCRC_Error())
        {
            _crcErrorCnt++;
            Debug("=== Start of Frame Flag Set with CRC error.\r\n");
        }
    }
    
}


// Interrupt handler
void AT90UsbDevice::HandleDeviceInterrupt()
{
    
    _deviceStatus = USBSTA;
    _interruptDeviceStatus.U_UDINT.Data = UDINT;
    
    if(_interruptDeviceStatus.U_UDINT.Flags.WAKEUP_flg == 1)
    {
        UsbDevDisableWakeupCPU_Int();
    }
    
    // reset intr
    UDINT = UDINT ^ _interruptDeviceStatus.U_UDINT.Data;
    
    _interruptDeviceStatus.U_USBINT.Data = USBINT;
    // reset intr
    USBINT = USBINT ^ _interruptDeviceStatus.U_USBINT.Data;
    
}

void AT90UsbDevice::HandleEndpointInterrupt()
{
//    BoardPortD2GreenOn();
    uint8_t mask;
    Debug("ISR(USB_COM_vect)\r\n");
    mask = UsbDevGetEndpointIntBits();
    while(mask != 0)
    {
        for (uint8_t ep = 0; ep < UsbNumEndpointsAT90USB; ep++)
        {
            if (mask & (1<<ep))
            {
                UsbEndpointBase* pUsbEndpoint = this->GetUsbEndpoint(ep);
                if(pUsbEndpoint == NULL)
                {
                    UsbDevSelectEndpoint(ep);
                    //UsbDevDisableAllInt();
                    continue;
                }
                else if (ep == 0)
                {
                   // BoardPortD5GreenOn();
                    ((UsbEndpointControl*)pUsbEndpoint)->HandleInterrupt();
                  //  BoardPortD5GreenOff();
                }
                else
                {
                    pUsbEndpoint->HandleInterrupt();
                }
                
                //UsbDevSelectEndpoint(ep);
                //switch (ep)
                //{
                //case 0:
                //PORTD |= (1<<PORTD6);
                //
                //if UsbDevHasReceivedSETUP()
                //At90UsbDevice._UsbEndpointControl.
                //UsbProcessSetupRequest();
                //
                //PORTD &= (~(1<<PORTD6));
                //break;
                //case 1:
                //UsbDevEP1IntAction();
                //break;
                //case 2:
                //UsbDevEP2IntAction();
                //break;
                //case 3:
                //UsbDevEP3IntAction();
                //break;
                //case 4:
                //UsbDevEP4IntAction();
                //break;
                //case 5:
                //UsbDevEP5IntAction();
                //break;
                //case 6:
                //UsbDevEP6IntAction();
                //break;
                //default:
                //Debug("Error in ISR(USB_COM_vect)\r\n");
                //}
            }
        }

        mask = UsbDevGetEndpointIntBits();
    }
  //  BoardPortD2GreenOff();
}

void AT90UsbDevice::ProcessEndpointInterrupt()
{
    

}

// TODO:: to be moved into UsbEndpointBase
void AT90UsbDevice::DisableAndFreeEndpoint(uint8_t i)
{
    UsbDevSelectEndpoint(i);
    UsbDevDisableEndpoint();
    UsbDevClearEndpointAllocBit();
    _UsbEndpoints[i] = 0;
}

void AT90UsbDevice::SetUnconfiguredState(void)
{
    //uint8_t i;
    UsbDevConfValue = UsbUnconfiguredState;
    //i =  UsbNumEndpointsAT90USB;
    
    uint8_t selectedEndpoint = UsbDevGetSelectedEndpoint();
    // free all endpoints but not EP0
    for (int i = 1; i < UsbNumEndpointsAT90USB ; i++)
    {
        // Disable and free endpoint.
        DisableAndFreeEndpoint(i);
    }
    
    UsbDevSelectEndpoint(selectedEndpoint);

    UsbAllocatedEPs = 1;
}

bool AT90UsbDevice::SetConfiguration(uint8_t c)
{
    uint8_t i;
    switch (c)
    {
        case 0: // go back to un-configured (addressed) state
        {
            SetUnconfiguredState();
            break;
        }
        
        case 1: // set configuration 1
        {
            if (UsbDevConfValue != c)
            {
                i = USB_MaxInterfaces;
                while (i-- > 0)
                {
                    AltSettingOfInterface[i] = UsbInterfaceUnconfigured;
                }
            }
            for (i = 0; i < USB_Interfaces[c-1]; i++)
            {
                if (!SetInterface(c, i , 0))
                {
                    SetUnconfiguredState();
                    return false;
                }
            }
            
        }
        UsbDevConfValue = c;
        break;
        default:
        Debug("UsbDevSetConfiguration(): configuration does not exist!\r\n");
        return false;
    }
    return true;
}

// Multiple interfaces can exist at the same time! These interfaces have to use different endpoints.
// For example interface 1 can use ep1 and ep2, and interface 2 can use some of the other endpoints (ep3, ep4, ep5, ep6).
// A special problem occurs from FIFO memory management of AT90USB: Memory for FIFO has to be allocated in growing order.
// If we use multiple interfaces with multiple alternate settings there may occur memory conflicts concerning FIFO memory:
// If we allocate memory for endpoint i, there may be an overlap with FIFO of endpoint i+1 or memory of endpoint i+1 may slide.
// This is a result of internal design of AT90USB, see section 21.7 in datasheet.
// But from USB design interfaces should be independent, changes of interface i should not affect interface j#i
// To prevent conflicts, following strategy is useful:
// Use endpoints 1 to n for interface 1, endpoints n+1 to m for interface 2, and endpoints m+1, m+2 ... for interface 3.
// Give only more than one alternate setting to the interface with the highest number. So changes of alternate setting
// with new FIFO sizes can not disturb other interfaces.
// If you really need more than one interface with different alternate settings (endpoint FIFO sizes) you may try to
// insert unused dummy endpoints to prevent memory slides or overlaps. Or use different configurations or force reallocation of all endpoints.
// Our application uses only interface 0 with endpoints ep1, ep2, ep3. But the code is designed to support more interfaces.
bool AT90UsbDevice::SetInterface(uint8_t conf, uint8_t inf, uint8_t as)
{
    uint8_t i;
    if (conf-- == UsbUnconfiguredState) // each interface should be bound to a configuration
    {
        Debug("SetInterface(): called from unconfigured (addressed) state!\r\n");
        return false;
    }
    
    if ((inf >= USB_Interfaces[conf]) || (as >= USB_AltSettings[conf][inf]))
    {
        Debug("SetInterface(): interface not supported!\r\n");
        return false;
    }
    
    if ((as > 0) && (inf != (USB_Interfaces[conf]-1)))
    {
        Debug("SetInterface(): Multiple interfaces with more than one alternate setting => FIFO memory conflicts may occur!\r\n");
        return false;
    }

    uint8_t selectEndpoint = UsbDevGetSelectedEndpoint();
    
    if (AltSettingOfInterface[inf] == as) // no changes, reset toggle bits of endpoints of this interface
    {
        if (conf == 0)
        {
            if (inf == 0) // first interface of first configuration
            {
                
                for (i = 1; i < 4; i++) // reset toggle bit of all endpoints of this interface; an endpoint reset may be necessary too
                {
                    UsbDevSelectEndpoint(i);
                    UsbDevResetEndpoint(i);
                    UsbDevResetDataToggleBit();
                }
                
            }
            else if (inf == 1) // second interface of first configuration
            {
                // reset endpoints of second interface
            }
        }
        else if (conf == 2) // similar operations
        {
        }
        
        UsbDevSelectEndpoint(selectEndpoint);
        return true;
    }
    
    if (conf == 0)
    {
        if (inf == 0) // first allocation or reallocation with new alternate setting
        {
            DisableAndFreeEndpoint(3);
            DisableAndFreeEndpoint(2);
            DisableAndFreeEndpoint(1);
            
            UsbAllocatedEPs = 1;
            AltSettingOfInterface[0] = UsbInterfaceUnconfigured;
            if (as == 0) // use alternate setting 0
            {
                
                UsbEndpointIn* endpointIn = (UsbEndpointIn*)At90UsbDevice.GetUsbEndpoint(1);
                if (endpointIn->InitializeEndpoint(UsbEP_TypeBulk, EP1_FIFO_Size, 1))
                //if (UsbDevEP_Setup(1, UsbEP_TypeBulk, EP1_FIFO_Size, 1, UsbEP_DirIn))
                {
                    Debug("!!! Successful set up EP1!\r\n");
                    //UsbDevSelectEndpoint(1); this ep is already selected by UsbDevEP_Setup()
                    UsbDevEnableNAK_IN_Int(); // trigger interrupt when host got a NAK as a result of a read request
                }
                else
                {
                    Debug("!!!  Setup of EP1 failed!\r\n"); // should not occur ;-)
                    UsbDevSelectEndpoint(selectEndpoint);
                    return false;
                }
                
                endpointIn = (UsbEndpointIn*)At90UsbDevice.GetUsbEndpoint(2);
                if (endpointIn->InitializeEndpoint(UsbEP_TypeBulk, EP2_FIFO_Size, 1))
                //if (UsbDevEP_Setup(2, UsbEP_TypeBulk, EP2_FIFO_Size, 2, UsbEP_DirIn))
                {
                    Debug("!!! Successful set up EP2!\r\n");
                }
                else
                {
                    Debug("!!!  Setup of EP2 failed!\r\n");
                    UsbDevSelectEndpoint(selectEndpoint);
                    return false;
                }
                
                UsbEndpointOut* endpointOut = (UsbEndpointOut*)At90UsbDevice.GetUsbEndpoint(3);
                if (endpointOut->InitializeEndpoint(UsbEP_TypeBulk, EP3_FIFO_Size, 1))
                //if (UsbDevEP_Setup(3, UsbEP_TypeBulk, EP3_FIFO_Size, 1, UsbEP_DirOut))
                {
                    Debug("!!! Successful set up EP3!\r\n");
                    UsbDevEnableReceivedOUT_DATA_Int(); // trigger interrupt when out data is available
                }
                else
                {
                    Debug("!!!  Setup of EP3 failed!\r\n");
                    UsbDevSelectEndpoint(selectEndpoint);
                    return false;
                }
            }
            else if (as == 1) // alternate setting 1
            {
                // set up same endpoints with different parameters (FIFO-size)
            }
            
            AltSettingOfInterface[0] = as;
            UsbStartupFinished = 1;
            UsbDevSelectEndpoint(selectEndpoint);
            return true;
        }
        else if (inf == 1) // setup interface 1
        {
        }
    }
    else if (conf == 1) // similar setup if configuration 2 with other interfaces is selected
    {
    }

    UsbDevSelectEndpoint(selectEndpoint);
    return false; // dummy to suppress compiler warning
}


void AT90UsbDevice::FillDeviceDescriptor(USB_DeviceDescriptor* d)
{
    d->bLength = USB_DeviceDescriptorLength;
    d->bDescriptorType = USB_DeviceDescriptorType;
    d->bcdUSB = USB_Spec1_1;
    d->bDeviceClass = UsbNoDeviceClass;
    d->bDeviceSubClass = UsbNoDeviceSubClass;
    d->bDeviceProtocoll = UsbNoDeviceProtokoll;
    d->bMaxPacketSize0 = EP0_FIFO_Size;
    d->idVendor = MyUSB_VendorID;
    d->idProduct = MyUSB_ProductID;
    d->bcdDevice = MyUSB_DeviceBCD;
    d->iManufacturer = USB_ManufacturerStringIndex;
    d->iProduct = USB_ProductStringIndex;
    d->iSerialNumber = USB_SerialNumberStringIndex;
    d->bNumConfigurations = USB_NumConfigurations;
}

bool AT90UsbDevice::FillConfigurationDescriptor(USB_ConfigurationDescriptor* c, uint8_t confIndex)
{
    uint8_t i;
    if (confIndex >= USB_NumConfigurations)
    {
        return false;
    }
    
    c->bLength = USB_ConfigurationDescriptorLength;
    c->bDescriptorType = USB_ConfigurationDescriptorType;
    c->wTotalLength = USB_ConfigurationDescriptorLength;
    
    i = USB_Interfaces[confIndex];
    
    c->bNumInterfaces = i;
    
    while (i-- > 0)
    {
        c->wTotalLength += (USB_InterfaceDescriptorLength+USB_EndpointDescriptorLength*USB_Endpoints[confIndex][i])*USB_AltSettings[confIndex][i];
    }
    
    c->bConfigurationValue = UsbConfigurationValue(confIndex);
    c->iConfiguration = UsbNoDescriptionString; // no textual configuration description
    c->bmAttributes = UsbConfDesAttrBusPowered; // bus-powered, no remote wakeup
    c->MaxPower = USB_MaxPower_2mA[confIndex];
    
    return true;
    
}

bool AT90UsbDevice::FillInterfaceDescriptor(USB_InterfaceDescriptor* i, uint8_t confIndex, uint8_t intIndex, uint8_t altSetting)
{
    if (  (confIndex >= USB_NumConfigurations)||
    (intIndex >= USB_Interfaces[confIndex])||
    (altSetting >= USB_AltSettings[confIndex][intIndex]))
    {
        return false;
    }
    
    i->bLength = USB_InterfaceDescriptorLength;
    i->bDescriptorType = USB_InterfaceDescriptorType;
    i->bInterfaceNumber = intIndex;
    i->bAlternateSetting = altSetting;
    i->bNumEndpoints = USB_Endpoints[confIndex][intIndex];
    i->bInterfaceClass = UsbNoInterfaceClass;
    i->bInterfaceSubClass = UsbNoInterfaceSubClass;
    i->bInterfaceProtocol = UsbNoInterfaceProtokoll;
    i->iInterface = UsbNoDescriptionString; // no textual interface description
    
    return true;
}


bool AT90UsbDevice::FillEndpointDescriptor(USB_EndpointDescriptor* e, uint8_t confIndex, uint8_t intIndex, uint8_t altSetting, uint8_t endIndex)
{
    if ((confIndex >= USB_NumConfigurations)||
    (intIndex >= USB_Interfaces[confIndex])||
    (altSetting >= USB_AltSettings[confIndex][intIndex])||
    (endIndex > USB_Endpoints[confIndex][intIndex]))
    {
        return false;
    }

    // components identical for all of our endpoints
    e->bLength = USB_EndpointDescriptorLength;
    e->bDescriptorType = USB_EndpointDescriptorType;
    e->bmAttributes = USB_BulkTransfer;
    e->bInterval = 0; // bulk endpoint, no polling
    e->bEndpointAddress = UsbInEndpointAdress(endIndex);
    // components which differ

    switch (endIndex) // only endpoints for interface 0 in our application
    {
        case 1:
        {
            e->wMaxPacketSize = EP1_FIFO_Size;
            break;
            
        }
        case 2:
        {
            e->wMaxPacketSize = EP2_FIFO_Size;
            break;
        }
        case 3:
        {
            e->wMaxPacketSize = EP3_FIFO_Size;
            break;
        }
        default:
        {
            e->wMaxPacketSize = 0;
            break;
        }
    }
    return true;
    
}
void AT90UsbDevice::FillStringDescriptor(char s[], uint8_t index)
{
    #if (USB_MaxStringDescriptorLength < 18)
    #error USB_MaxStringDescriptorLength too small!
    #endif
    
    memset(s,0,USB_MaxStringDescriptorLength);
    s -= USB_MaxStringDescriptorLength;
    s[1] = USB_StringDescriptorType;
    
    switch (index)
    {
        case USB_LanguageDescriptorIndex: // == 0
        {
            
            s[0] = 4;
            s[2] = 9; // two byte language code, only support for English
            s[3] = 4;
            break;
        }
        case USB_ManufacturerStringIndex:
        {
            s[2] = 'S';
            s[4] = 'A';
            s[6] = 'L';
            s[8] = 'E';
            s[10] = 'W';
            s[12] = 'S';
            s[14] = 'K';
            s[16] = 'I';
            s[0] = 18; // length of descriptor
            break;
        }

        case USB_ProductStringIndex:
        {
            s[2] = 'A';
            s[4] = 'T';
            s[6] = '9';
            s[8] = '0';
            s[10] = 'U';
            s[12] = 'S';
            s[14] = 'B';
            s[0] = 16;
            break;
        }
        case USB_SerialNumberStringIndex:
        {
            s[2] = '0';
            s[4] = '0';
            s[6] = '1';
            s[0] = 8;
        }
        break;
        default:
        {
            s[2] = '?';
            s[0] = 4;
            break;
        }
    }
}

